app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (quotation like '%Mroczny%') ORDER BY created_at DESC
---
  def index
   # @movies = Movie.all

  if params[:tytul]
    @movies.downcase = Movie.search(params[:tytul].downcase)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @movie = Movie.find(params[:id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @movie = Movie.find(params[:id])

INSERT INTO "movies" ("created_at", "dlugosc", "gatunek", "moja_ocena", "ocena_filmweb", "ocena_imdb", "rezyser", "tytul", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "tytul" = 'Bekarty Wojny', "dlugosc" = 153, "ocena_filmweb" = 7.9, "ocena_imdb" = 8.3, "updated_at" = '2012-11-02 11:54:15.061327' WHERE "movies"."id" = 8
---
  def update
    @movie = Movie.find(params[:id])

    respond_to do |format|
      if @movie.update_attributes(params[:movie])